XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G22x_Series.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ABOV</vendor>
  <name>A31G22x_Series</name>
  <description>ABOV Semiconductor A31G22x Device Support, Drivers and Examples</description>
  <url>https://www.abov.co.kr/data/mds/PACK/</url>
  <supportContact>abov_fae@abov.co.kr</supportContact>
  <releases>
    <release version="1.0.0" date="2021-05-13">
            - First Release for A31G226, A31G224
    </release>
  </releases>
  <keywords>
    <!-- keywords for indexing -->
    <keyword>ABOV</keyword>
    <keyword>A31G22x</keyword>
    <keyword>A31G226</keyword>
    <keyword>A31G224</keyword>
    <keyword>General Purpose</keyword>
    <keyword>32bit</keyword>
    <keyword>Memory Swap</keyword>
  </keywords>
  <devices>
    <family Dfamily="A31G22x Series" Dvendor="ABOV Semiconductor:126">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" />
      <description>The ABOV A31G22x Series device family contains an ARM Cortex-M0+ processor with a versatile set of on-chip peripherals</description>
      <!-- Subfamily : A31G22x *********************************************************-->
      <subFamily DsubFamily="A31G22x">
        <processor Dclock="48000000" />
        <compile header="A31G22x/Core/Device/ABOV/A31G22x/Include/A31G22x.h" />
        <debug svd="A31G22x/Svd/A31G22x.svd" />
          <feature type="VCC" n="1.8" m="5.5" />
	      <feature type="NVIC"            n="32"                    name="NVIC with 32 Interrupt Sources" />
	      <feature type="DMA"             n="8"                     name="DMA" />
	      <feature type="Memory"          n="256"                   name="Internal Code Flash Memory (CFMC)" />
	      <feature type="Memory"          n="32"                    name="Internal Data Flash Memory (DFMC)" />
	      <feature type="XTAL"            n="4000000" m="16000000"  name="External Crystal Oscillator (XTAL) "/>
	      <feature type="IntRC"           n="32000000"              name="Internal RC Oscillator with +/- 1% accuracy"/>
          <feature type="PLL"             n="1"                     name="Internal PLL up to 48MHz"/>
          <feature type="PowerMode"       n="3"                     name="Run, Sleep (Idle), Deep-Sleep (Power-down)"/>
          <feature type="PowerOther"      n="1"                     name="POR"/>
          <feature type="IOs"             n="75"                    name="GPIOs of 80-LQFP Package"/>
          <feature type="IOs"             n="75"                    name="GPIOs of 64-LQFP Package"/>
          <feature type="IOs"             n="75"                    name="GPIOs of 48-LQFP Package"/>
	      <feature type="UART"            n="2"                     name="UART Interface" />
	      <feature type="USART"           n="4"       				name="USART Interface" />
	      <feature type="SPI"             n="2"                     name="SPI Interface" />
	      <feature type="I2C"             n="2"                     name="I2C Interface" />
	      <feature type="ADC"             n="1"       m="12"        name="1 Msps High Performance 12-bit ADC" />
	      <feature type="DAC"             n="1"       m="12"        name="12-bit DAC" />
	      <feature type="TempSens"        n="1"                     name="Internal Temp Sensor" />
	      <feature type="Timer"           n="7"       m="16"        name="16-bit TIMER (TIMER1n)" />
	      <feature type="Timer"           n="2"       m="32"        name="32-bit TIMER (TIMER2n)" />
	      <feature type="PWM"             n="1"       m="16"        name="3-phase complementary PWM (TIMER3n)" />
	      <feature type="WDT"             n="1"                     name="Watch-dog Timer" />
	      <feature type="LCD"             n="1"       m="8.44"      name="LCD Driver (8-COM x 44-SEG)" />
		  <feature type="QFP"             n="80"                    name="80-LQFP Package (12x12, 14x14)"/>
		  <feature type="QFP"             n="64"                    name="64-LQFP Package (12x12, 10x10)"/>
		  <feature type="QFP"             n="47"                    name="48-LQFP Package (7x7)"/>

        <memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1" />
        <!-- Device : A31G226-->
        <device Dname="A31G226">
          <description>256KB Flash Memory</description>
          <algorithm name="A31G22x\Flashloader\Keil\A31G226.FLM" start="0x00000000" size="0x40000" default="1" />
          <memory id="IROM1" start="0x00000000" size="0x40000" startup="1" default="1" />
        </device>
        <!-- Device : A31G224-->
        <device Dname="A31G224">
          <description>256KB Flash Memory</description>
          <algorithm name="A31G22x\Flashloader\Keil\A31G224.FLM" start="0x00000000" size="0x20000" default="1" />
          <memory id="IROM1" start="0x00000000" size="0x20000" startup="1" default="1" />
        </device>
      </subFamily>
    </family>
  </devices>
  <conditions>


    <!-- condition : A31G226/A31G224 ********************************************************-->
    <condition id="A31G22x CMSIS">
      <description>filter for A31G226/A31G224 device and athe ARM compiler</description>
      <require Tcompiler="ARMCC" />
      <require Cclass="CMSIS" Cgroup="CORE" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31G226" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31G224" />
    </condition>
  </conditions>

  <components>
    <!-- component : A31G226/A31G224 ********************************************************-->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>System Startup for ABOV A31G22x devices</description>
      <files>
        <file category="include" name="A31G22x/Core/Device/ABOV/A31G22x/Include/" />
        <file category="header" version="1.0.0" name="A31G22x/Core/Device/ABOV/A31G22x/Include/A31G22x.h" attr="config" />
        <file category="header" version="1.0.0" name="A31G22x/Core/Device/ABOV/A31G22x/Include/system_A31G22x.h" attr="config" />

        <file category="include" name="A31G22x/Core/Device/ABOV/A31G22x/Source/" />
        <file category="source" version="1.0.0" name="A31G22x/Core/Device/ABOV/A31G22x/Source/system_A31G22x.c" attr="config" />

        <file category="include" name="A31G22x/Core/Device/ABOV/A31G22x/Source/ARM/" />
        <file category="source" version="1.0.0" name="A31G22x/Core/Device/ABOV/A31G22x/Source/ARM/startup_A31G22x.s" attr="config" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="Common" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>Common HAL Driver</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_aa_types.h" attr="config" version="1.0.0" />
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_assert.h" attr="config" version="1.0.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="Debug_frameWork" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>Debug Framework</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/debug.h" attr="config" version="1.0.0" />
        <file category="header" name="A31G22x/Drivers/Include/debug_cmd.h" attr="config" version="1.0.0" />
        <file category="header" name="A31G22x/Drivers/Include/debug_frmwrk.h" attr="config" version="1.0.0" />
        <file category="source" name="A31G22x/Drivers/Source/debug.c" attr="config" version="1.0.0" />
        <file category="source" name="A31G22x/Drivers/Source/debug_cmd.c" attr="config" version="1.0.0" />
        <file category="source" name="A31G22x/Drivers/Source/debug_frmwrk.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="adc" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL driver for Analog to Digital Converter (ADC)</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_adc.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_adc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="cfmc" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL driver for Code Flash Memory (CFMC)</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_cfmc.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_cfmc.c" />
      </files>
    </component>
