XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G22x_Series.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="cmp" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL driver for Comparator (CMP)</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_cmp.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_cmp.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="crc" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL driver for CRC</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_crc.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_crc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="dac" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL driver for Digital to Analog Converter (DAC)</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_dac.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_dac.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="dfmc" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL driver for Data Flash Memory Controller (DFMC)</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_dfmc.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_dfmc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="dmac" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL driver for Direct Memory Access Controller (DMAC) </description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_dmac.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_dmac.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="i2c" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL dirver for I2C interface</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_i2c.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_i2c.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="lcd" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL dirver for LCD Driver</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_lcd.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_lcd.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="spi" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL Driver for SPI interface</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_spi.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_spi.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="pcu" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL Driver for GPIO and Port Control Unit (PCU) </description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_pcu.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_pcu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="pwr" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL Driver for POWER Control (PWR)</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_pwr.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_pwr.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="scu" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL Driver for System Control Unit (SCU)</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_scu.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_scu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="timer1n" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL Driver for 16-bit Timer (TIMER1n)</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_timer1n.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_timer1n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="timer2n" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL Driver for 32-bit Timer (TIMER2n)</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_timer2n.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_timer2n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="timer3n" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL Driver for 3-phase complementary PWM (TIMER3n)</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_timer3n.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_timer3n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="uart" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL Driver for A31G22x UART Interface</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_uartn.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_uartn.c" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="usart" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL Driver for A31G22x USART Interface</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_usart1n.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_usart1n.c" />
      </files>
    </component>
	<component Cclass="Device" Cgroup="Drivers" Csub="ts" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL Driver for Temp Sensor (TS)</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_ts.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_ts.c" />
      </files>
    </component>
