XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G22x_Series.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="wdt" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL Driver for A31G22x Watch-dog Timer (WDT)</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_wdt.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_wdt.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="wt" Cversion="1.0.0" condition="A31G22x CMSIS">
      <description>HAL Driver for Watch Timer (WT)</description>
      <files>
        <file category="header" name="A31G22x/Drivers/Include/A31G22x_hal_wt.h" />
        <file category="source" name="A31G22x/Drivers/Source/A31G22x_hal_wt.c" />
      </files>
    </component>
  </components>

  <boards>
    <!-- board : STK-A31G326MLN-A v1.1 ************************************************************-->
    <board vendor="ABOV" name="StarterKit-A31G226MLN-A" revision="V1.1">
      <description>STK-A31G326MLN-A STARTER KIT v1.1</description>
      <mountedDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A31G226" />
      <compatibleDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A31G224" />
      <feature type="ODbg"   n="1"              name="On-board Type A-Link Debugger"/>
      <feature type="ROM"                       name="256KB Internal Code Flash Memory" />
      <feature type="ROM"                       name="32KB Internal Data Flash Memory" />
      <feature type="RAM"                       name="20KB SRAM" />
      <feature type="XTAL"   n="8000000"        name="8MHz Crystal Oscillator" />
      <feature type="Other"                     name="32.768kHz RTC Sub Crystal Oscillator" />
      <feature type="PWR"    n="3.3"   m="5.0"  name="USB Powered" />
      <feature type="PWR"    n="1.8"   m="5.0"  name="External Power Supply" />
      <feature type="Button" n="2"              name="Tact-buttons : USER and nRESET" />
      <feature type="LED"    n="6"              name="6 LEDs: D101~106" />
	  <debugInterface adapter="CMSIS-DAP" connector="Mini-USB" />
    </board>
  </boards>


  <!-- example : A31G226/A31G224 **********************************************************-->
  <examples>

    <!-- ADC examples *********************************************************************-->
    <example name="ADC Buffer Example" doc="Abstract.txt" folder="A31G22x/Example/ADC/ADC_Buffer">
      <description>ADC Buffer Function Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/ADC_Buffer.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ADC Burst Mode Example" doc="Abstract.txt" folder="A31G22x/Example/ADC/ADC_Burst">
      <description>ADC Burst Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/ADC_Burst.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ADC Compare Function " doc="Abstract.txt" folder="A31G22x/Example/ADC/ADC_Compare">
      <description>ADC Compare Function Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/ADC_Compare.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ADC Peri-to-Peri DMA Function Example" doc="Abstract.txt" folder="A31G22x/Example/ADC/ADC_dmac_p2p">
      <description>ADC Peri-to-Peri DMA Function Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/ADC_dmac_p2p.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ADC Rx DMA Function Example" doc="Abstract.txt" folder="A31G22x/Example/ADC/ADC_dmac_rx">
      <description>ADC Rx DMA Function Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/ADC_dmac_rx.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ADC Tx DMA Function Example" doc="Abstract.txt" folder="A31G22x/Example/ADC/ADC_dmac_tx">
      <description>ADC Tx DMA Function Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/ADC_dmac_tx.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ADC Interrupt Mode Example" doc="Abstract.txt" folder="A31G22x/Example/ADC/ADC_Interrupt">
      <description>ADC Interrupt Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/ADC_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ADC Multiple Mode Example" doc="Abstract.txt" folder="A31G22x/Example/ADC/ADC_Multiple">
      <description>ADC Multiple Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/ADC_Multiple.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ADC Polling Mode Example" doc="Abstract.txt" folder="A31G22x/Example/ADC/ADC_Polling">
      <description>ADC Polling Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/ADC_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ADC Sequence Mode Example" doc="Abstract.txt" folder="A31G22x/Example/ADC/ADC_Sequence">
      <description>ADC Sequence Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/ADC_Sequence.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- CFMC examples *********************************************************************-->
    <example name="CFMC Test Example" doc="Abstract.txt" folder="A31G22x/Example/CFMC/CFMC_Test">
      <description>CFMC Test Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CFMC_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CFMC Read Protection Example" doc="Abstract.txt" folder="A31G22x/Example/CFMC/CFMC_ReadProtection">
      <description>CFMC Read Protection Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CFMC_ReadProtection.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CFMC Memory Swap Example" doc="Abstract.txt" folder="A31G22x/Example/CFMC/CFMC_MemorySwap">
      <description>CFMC Memory Swap Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CFMC_MemorySwap.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- Clock Change examples *********************************************************************-->
    <example name="HSE System Clock Change Example" doc="Abstract.txt" folder="A31G22x/Example/ClkChange/HSE_SystemClockChange">
      <description>HSE System Clock Change Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/HSE_SystemClockChange.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="HSE PLL System Clock Change Example" doc="Abstract.txt" folder="A31G22x/Example/ClkChange/HSEPLL_SystemClockChange">
      <description>HSE PLL System Clock Change Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/HSEPLL_SystemClockChange.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="HSI System Clock Change Example" doc="Abstract.txt" folder="A31G22x/Example/ClkChange/HSI_SystemClockChange">
      <description>HSI System Clock Change Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/HSI_SystemClockChange.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="HSI PLL System Clock Change Example" doc="Abstract.txt" folder="A31G22x/Example/ClkChange/HSIPLL_SystemClockChange">
      <description>HSI PLL System Clock Change Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/HSIPLL_SystemClockChange.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="LSE System Clock Change Example" doc="Abstract.txt" folder="A31G22x/Example/ClkChange/LSE_SystemClockChange">
      <description>LSE System Clock Change Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/LSE_SystemClockChange.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="LSI System Clock Change Example" doc="Abstract.txt" folder="A31G22x/Example/ClkChange/LSI_SystemClockChange">
      <description>LSI System Clock Change Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/LSI_SystemClockChange.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- CMP examples *********************************************************************-->
    <example name="Comparator Edge Polarity Monitoring Example" doc="Abstract.txt" folder="A31G22x/Example/CMP/CMP_EdgePoleMonitoring">
      <description>Comparator Edge Polarity Monitoring Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CMP_EdgePoleMonitoring.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="Comparator Interrupt Mode Example" doc="Abstract.txt" folder="A31G22x/Example/CMP/CMP_Interrupt">
      <description>Comparator Interrupt Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CMP_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="Comparator NMI Interrupt Function Example" doc="Abstract.txt" folder="A31G22x/Example/CMP/CMP_Nmi">
      <description>Comparator NMI Interrupt Function Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CMP_Nmi.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="Comparator Polling Mode Example" doc="Abstract.txt" folder="A31G22x/Example/CMP/CMP_Polling">
      <description>Comparator Polling Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CMP_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- CORE examples *********************************************************************-->
    <example name="Interrupt Priority Example" doc="Abstract.txt" folder="A31G22x/Example/CORE/Interrupt_Priority">
      <description>Interrupt Priority Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Interrupt_Priority.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="Systick Interrupt Timer Example" doc="Abstract.txt" folder="A31G22x/Example/CORE/Systick_Test">
      <description>Systick Interrupt Timer Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Systick_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- CRC examples *********************************************************************-->
    <example name="CRC Example" doc="Abstract.txt" folder="A31G22x/Example/CRC/CRC_AutoTest">
      <description>CRC Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CRC_AutoTest.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CRC with DMA Example" doc="Abstract.txt" folder="A31G22x/Example/CRC/CRC_AutoTestDma">
      <description>CRC with DMA Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CRC_AutoTestDma.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- DAC examples *********************************************************************-->
    <example name="DAC Buffer Auto Clear Function Example" doc="Abstract.txt" folder="A31G22x/Example/DAC/DAC_BufferClear">
      <description>DAC Buffer Auto Clear Function Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/DAC_BufferClear.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="DAC Interrupt Mode Example 1" doc="Abstract.txt" folder="A31G22x/Example/DAC/DAC_Interrupt1">
      <description>DAC Interrupt Mode Example 1</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/DAC_Interrupt1.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="DAC Interrupt Mode Example 2" doc="Abstract.txt" folder="A31G22x/Example/DAC/DAC_Interrupt2">
      <description>DAC Interrupt Mode Example 2</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/DAC_Interrupt2.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="DAC Polling Mode Example" doc="Abstract.txt" folder="A31G22x/Example/DAC/DAC_Polling">
      <description>DAC Polling Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/DAC_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="DAC Timer Trigger Example" doc="Abstract.txt" folder="A31G22x/Example/DAC/DAC_TimerTrigger">
      <description>DAC Timer Trigger Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/DAC_TimerTrigger.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- DFMC examples *********************************************************************-->
    <example name="DFMC Test Example" doc="Abstract.txt" folder="A31G22x/Example/DFMC/DFMC_Test">
      <description>DFMC Test Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/DFMC_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="DFMC Read Protection Example" doc="Abstract.txt" folder="A31G22x/Example/DFMC/DFMC_ReadProtection">
      <description>DAC Read Protection Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/DFMC_ReadProtection.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- GPIO examples *********************************************************************-->
    <example name="GPIO Input Debounce Example" doc="Abstract.txt" folder="A31G22x/Example/GPIO/GPIO_InputDebounce">
      <description>GPIO Input Debounce Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/GPIO_InputDebounce.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="GPIO Input Interrupt Mode Example" doc="Abstract.txt" folder="A31G22x/Example/GPIO/GPIO_InputInterrupt">
      <description>GPIO Input Interrupt Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/GPIO_InputInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="GPIO Input Polling Mode Example" doc="Abstract.txt" folder="A31G22x/Example/GPIO/GPIO_InputPolling">
      <description>GPIO Input Polling Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/GPIO_InputPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="GPIO High Current Output Port Example" doc="Abstract.txt" folder="A31G22x/Example/GPIO/GPIO_ISEG">
      <description>GPIO High Current Output Port Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/GPIO_ISEG.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="GPIO Output Mode Example" doc="Abstract.txt" folder="A31G22x/Example/GPIO/GPIO_Output">
