XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G22x_Series.pdsc
      <description>GPIO Output Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/GPIO_Output.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="GPIO Strength Function Example" doc="Abstract.txt" folder="A31G22x/Example/GPIO/GPIO_Strength">
      <description>GPIO Strength Function Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/GPIO_Strength.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- I2C examples *********************************************************************-->
    <example name="I2C Interrupt Mode EEPROM Example" doc="Abstract.txt" folder="A31G22x/Example/I2C/I2C_EEPROM_Interrupt">
      <description>I2C Interrupt Mode EEPROM Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/I2C_EEPROMInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="I2C Polling Mode EEPROM Example" doc="Abstract.txt" folder="A31G22x/Example/I2C/I2C_EEPROM_Polling">
      <description>I2C Polling Mode EEPROM Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/I2C_EEPROMPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="I2C Master Interrupt Mode Example" doc="Abstract.txt" folder="A31G22x/Example/I2C/I2C_Master_Interrupt">
      <description>II2C Master Interrupt Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/I2C_Master_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- LCD Driver examples *********************************************************************-->
    <example name="LCD Driver Polling Example" doc="Abstract.txt" folder="A31G22x/Example/LCD/LCD_Polling">
      <description>LCD Driver Polling Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/LCD_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- PWR examples *********************************************************************-->
    <example name="Deep-sleep and GPIO wake-up Example" doc="Abstract.txt" folder="A31G22x/Example/PWR/PWR_GpioDeepSleep">
      <description>Deep-sleep (Power-down) and GPIO wake-up Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/PWR_GpioDeepSleep.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="Sleep and GPIO wake-up Example" doc="Abstract.txt" folder="A31G22x/Example/PWR/PWR_GpioSleep">
      <description>Sleep (Idle) and GPIO wake-up Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/PWR_GpioSleep.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- SCU examples *********************************************************************-->
    <example name="SCU Clock Monitoring Example" doc="Abstract.txt" folder="A31G22x/Example/SCU/SCU_ClkMonitor">
      <description>SCU Clock Monitoring Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SCU_ClkMonitor.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="LVD Reset (LVR) Example" doc="Abstract.txt" folder="A31G22x/Example/SCU/SCU_LvdTest">
      <description>LVD Reset (LVR) Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SCU_LvdTest.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="LVD Interrupt (LVI) Example" doc="Abstract.txt" folder="A31G22x/Example/SCU/SCU_LviTest">
      <description>LVD Interrupt (LVI) Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SCU_LviTest.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="PLL Clock Timer Example" doc="Abstract.txt" folder="A31G22x/Example/SCU/SCU_PllTimerClk">
      <description>PLL Clock Timer Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SCU_PllTimerClk.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="SCU System Clock Setting Example" doc="Abstract.txt" folder="A31G22x/Example/SCU/SCU_SystemClk">
      <description>SCU System Clock Setting Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SCU_SystemClk.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- SPI examples *********************************************************************-->
    <example name="SPI DMA Example" doc="Abstract.txt" folder="A31G22x/Example/SPI/SPI_Dma">
      <description>SPI DMA Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SPI_Dma.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="SPI EEPROM Example" doc="Abstract.txt" folder="A31G22x/Example/SPI/SPI_EEPROM">
      <description>SPI EEPROM Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SPI_EEPROM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="SPI Interrupt Mode Example" doc="Abstract.txt" folder="A31G22x/Example/SPI/SPI_Interrupt">
      <description>SPI Interrupt Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SPI_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="SPI Strength Function Example" doc="Abstract.txt" folder="A31G22x/Example/SPI/SPI_InterruptwithStrength">
      <description>SPI Interrupt Mode with Strength Function for High Speed</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SPI_InterruptwithStrength.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="SPI SPI_Polling Mode Example" doc="Abstract.txt" folder="A31G22x/Example/SPI/SPI_Polling">
      <description>SPI Polling Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SPI_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- SRAM examples *********************************************************************-->
    <example name="SRAM Example" doc="Abstract.txt" folder="A31G22x/Example/SRAM/SRAM_Test">
      <description>SRAM Test Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SRAM_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- StarterKit examples *********************************************************************-->
    <example name="StarterKit GPIO Blinky" doc="Abstract.txt" folder="A31G22x/Example/StarterKit/debug_cprintf">
      <description>StarterKit GPIO Blinky example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/debug_cprintf.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="StarterKit Debug framework Example" doc="Abstract.txt" folder="A31G22x/Example/StarterKit/GPIO_LedBlinky">
      <description>StarterKit Debug Framework example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/GPIO_LedBlinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- Timer1n examples *********************************************************************-->
    <example name="TIMER1n Capture Mode Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER1n/TIMER1n_Capture">
      <description>TIMER1n Capture Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER1n_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER1n Interrupt Mode Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER1n/TIMER1n_Interrupt">
      <description>TIMER1n Interrupt Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER1n_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER1n Oneshot Mode Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER1n/TIMER1n_Oneshot">
      <description>TIMER1n Oneshot Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER1n_Oneshot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER1n Polling Mode Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER1n/TIMER1n_Polling">
      <description>TIMER1n Polling Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER1n_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER1n PWM Mode Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER1n/TIMER1n_Pwm">
      <description>TIMER1n PWM Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER1n_Pwm.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- Timer2n examples *********************************************************************-->
    <example name="TIMER2n Capture Mode Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER2n/TIMER2n_Capture">
      <description>TIMER2n Capture Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER2n_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER2n Capture Mode with WDT Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER2n/TIMER2n_CaptureWdt">
      <description>TIMER2n Capture Mode with WDT Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER2n_CaptureWdt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER2n Interrupt Mode Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER2n/TIMER2n_Interrupt">
      <description>TIMER2n Interrupt Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER2n_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER2n Oneshot Mode Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER2n/TIMER2n_Oneshot">
      <description>TIMER2n Oneshot Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER2n_Oneshot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER2n PWM Mode Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER2n/TIMER2n_Pwm">
      <description>TIMER2n PWM Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER2n_Pwm.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- TIMER3n examples *********************************************************************-->
    <example name="TIMER3n ADC Trigger Mode Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER3n/TIMER3n_AdcTrigger">
      <description>TIMER3n ADC Trigger Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER3n_AdcTrigger.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER3n Capture  Mode Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER3n/TIMER3n_Capture">
      <description>TIMER3n Capture Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER3n_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER3n External Input Signal Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER3n/TIMER3n_ExtInputSignal">
      <description>TIMER3n External Input Signal Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER3n_ExtInputSignal.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER3n Interrupt Mode Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER3n/TIMER3n_Interrupt">
      <description>TIMER3n Interrupt Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER3n_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER3n NMI Function Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER3n/TIMER3n_Nmi">
      <description>TIMER3n NMI Function Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER3n_Nmi.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER3n Polling Mode Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER3n/TIMER3n_Polling">
      <description>TIMER3n Polling Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER3n_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER3n PWM Mode Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER3n/TIMER3n_Pwm">
      <description>TIMER3n PWM Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER3n_Pwm.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER3n Sync with TIMER1n Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER3n/TIMER3n_Sync">
      <description>TIMER3n Sync with TIMER1n Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER3n_Sync.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="TIMER3n Sync and Clear with TIMER1n Example" doc="Abstract.txt" folder="A31G22x/Example/TIMER3n/TIMER3n_SyncClear">
      <description>TIMER3n Sync and Clear with TIMER1n Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER3n_SyncClear.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- Temp Sensor examples *********************************************************************-->
    <example name="Temp Sensor Polling Example" doc="Abstract.txt" folder="A31G22x/Example/TS/TS_Polling">
      <description>Temp Sensor Polling Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TS_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="Temp Sensor Interrupt Example" doc="Abstract.txt" folder="A31G22x/Example/TS/TS_Interrupt">
      <description>Temp Sensor Interrupt Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TS_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
