XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G22x_Series.pdsc
    <!-- UART examples *********************************************************************-->
    <example name="UART Interrupt Mode Example" doc="Abstract.txt" folder="A31G22x/Example/UART/UART_Interrupt">
      <description>UART Interrupt Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/UART_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="UART Polling Mode Example" doc="Abstract.txt" folder="A31G22x/Example/UART/UART_Polling">
      <description>UART Polling Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/UART_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="UART Polling Mode Example" doc="Abstract.txt" folder="A31G22x/Example/UART/UART_PollingDma">
      <description>UART Polling Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/UART_PollingDma.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- USART examples *********************************************************************-->
    <example name="USART - UART Interrupt Mode Example" doc="Abstract.txt" folder="A31G22x/Example/USART/USART_UartInterrupt">
      <description>USART - UART Interrupt Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/USART_UartInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="USART - UART Interrupt DMA Mode Example" doc="Abstract.txt" folder="A31G22x/Example/USART/USART_UartInterruptDma">
      <description>USART - UART Interrupt DMA Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/USART_UartInterruptDma.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="USART - UART Polling Mode Example" doc="Abstract.txt" folder="A31G22x/Example/USART/USART_UartPolling">
      <description>USART - UART Polling Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/USART_UartPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- WDT examples *********************************************************************-->
    <example name="WDT Clock Source Example" doc="Abstract.txt" folder="A31G22x/Example/WDT/WDT_ClkSrc">
      <description>WDT Clock Source Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/WDT_ClkSrc.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="WDT Deep-sleep and Wakeup Example" doc="Abstract.txt" folder="A31G22x/Example/WDT/WDT_DeepSleepWakeup">
      <description>WDT Deep-sleep and Wakeup Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/WDT_DeepSleepWakeup.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="WDT NMI Example" doc="Abstract.txt" folder="A31G22x/Example/WDT/WDT_Nmi">
      <description>WDT NMI Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/WDT_Nmi.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="WDT Reset Function Example 1" doc="Abstract.txt" folder="A31G22x/Example/WDT/WDT_Reset1">
      <description>WDT Reset Function Example 1</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/WDT_Reset1.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="WDT Reset Function Example 2" doc="Abstract.txt" folder="A31G22x/Example/WDT/WDT_Reset2">
      <description>WDT Reset Function Example 2</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/WDT_Reset2.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="WDT Sleep and Wake-up Example" doc="Abstract.txt" folder="A31G22x/Example/WDT/WDT_SleepWakeup">
      <description>WDT Sleep and Wake-up Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/WDT_SleepWakeup.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="WDT Underflow and Window Match Interrupt Example" doc="Abstract.txt" folder="A31G22x/Example/WDT/WDT_UnderFlowAndWinMatch">
      <description>WDT Underflow and Window Match Interrupt Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/WDT_UnderFlowAndWinMatch.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="WDT Underflow Interrupt Example" doc="Abstract.txt" folder="A31G22x/Example/WDT/WDT_UnderFlowInterrupt">
      <description>WDT Underflow Interrupt Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/WDT_UnderFlowInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="WDT Window Match Interrupt" doc="Abstract.txt" folder="A31G22x/Example/WDT/WDT_WindowMatchInterrupt">
      <description>WDT Window Match Interrupt Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/WDT_WindowMatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <!-- WT examples *********************************************************************-->
    <example name="WT Clock Source Example" doc="Abstract.txt" folder="A31G22x/Example/WT/WT_ClkSrc">
      <description>WT Clock Source Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/WT_ClkSrc.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="WT Deep-sleep and Wake-up Example" doc="Abstract.txt" folder="A31G22x/Example/WT/WT_DeepSleepWakeup">
      <description>WT Deep-sleep and Wake-up Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/WT_DeepSleepWakeup.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="WT Interrupt Mode Example" doc="Abstract.txt" folder="A31G22x/Example/WT/WT_Interrupt">
      <description>WT Interrupt Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/WT_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="WT Polling Mode Example" doc="Abstract.txt" folder="A31G22x/Example/WT/WT_Polling">
      <description>WT Polling Mode Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/WT_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="WT Reset Mask Function Example" doc="Abstract.txt" folder="A31G22x/Example/WT/WT_ResetMask">
      <description>WT Reset Mask Function Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/WT_ResetMask.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="WT Sleep and Wake-up Example" doc="Abstract.txt" folder="A31G22x/Example/WT/WT_SleepWakeup">
      <description>WT Sleep and Wake-up Example</description>
      <board name="StarterKit-A31G226MLN-A" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/WT_SleepWakeup.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>
</package>
